import  { metadata } from "./metadata";
import ProductOptions from "@/app/components/ApparatsOptions";
import { use } from "react";

export { metadata };



export default function ShopPage() {
  const ProductName = 'Самогонний апарат "Старт" на відкритому кубі';
  const ProductPrice = [7615,8054,8576,11875];
  const ProductVolume = [15,23,37,60];
  const ShortDescription = 'Самогонний апарат «Старт» з відкритим кубом — ідеальний вибір для тих, хто цінує простоту та зручність у процесі перегонки. Завдяки відкритій конструкції куба ви зможете легко контролювати процес, швидко заливати брагу та очищати ємність після використання. Апарат виготовлений із високоякісної харчової нержавіючої сталі, що гарантує довговічність та безпечність у приготуванні напоїв. «Старт» підходить для всіх типів плит — газових, електричних та індукційних, роблячи процес винокуріння доступним і комфортним у будь-яких умовах.';
  const Description = '<p>Самогонний апарат «Старт» з відкритим кубом — чудове рішення для тих, хто цінує зручність і простоту у процесі домашнього самогоноваріння. Завдяки відкритій конструкції куба апарат легко наповнювати та очищати, що робить його особливо практичним у використанні. Виготовлений із харчової нержавіючої сталі, він забезпечує надійність та довговічність.</p><h4>Особливості:</h4><ul><li><strong>Матеріал:</strong> харчова нержавіюча сталь, стійка до корозії, зберігає смак та якість напою.</li><li><strong>Підключення:</strong> сумісний з газовими, електричними та індукційними плитами.</li><li><strong>Комплектація:</strong> повний сантехнічний набір з силіконовими прокладками, ущільнювачами, баранчиками для фіксації елементів, насадками Панченкова для додаткового очищення парів, шлангами та краном для зливу.</li> <li><strong>Зручність:</strong> відкритий куб спрощує заливання браги та миття після перегонки.</li></ul><p>Апарат дозволяє отримати якісний та чистий дистилят, зберігаючи ароматичні властивості сировини. Компактний розмір робить його ідеальним для використання в умовах домашньої кухні.</p>';
  const Gallery = ['start-15-l-700x700.jpg','12a-700x700.jpg', '3a-700x700.jpg', 'emkost-15-700x700 (1).jpg', '6a-700x700 (1).jpg','start-700x700.png', '12a-700x700.jpg']

  return (
    <ProductOptions
      product_name={ProductName}
      volumes={ProductVolume}
      prices={ProductPrice}
      short_description={ShortDescription}
      descriptions={Description}
      gallery={Gallery}
    />
  );
}
