import { createMetadata } from "@/app/seo/createMetadata";

export const metadata = {
  ...createMetadata(
    "Кулінарний калькулятор онлайн – конвертація грамів у склянки, ложки та чайні ложки",
    "Без ваги на кухні? Наш онлайн кулінарний калькулятор допоможе швидко перетворити грами інгредієнтів у склянки, столові та чайні ложки. Підходить для борошна, цукру, солі, масла, молока та багатьох інших продуктів. Зручно для випічки та щоденного приготування!",
    "shop/49aa9d8e-c889-47fd-9967-fe069d228593.webp",
  ),
  alternates: {
    canonical: 'https://www.smakota.club/calc',
  },
};