import { createMetadata } from "@/app/seo/createMetadata";

export const metadata = {
  ...createMetadata(
    'Самогонний апарат «Бебі Бум»',
    "Самогонний апарат «Бебі Бум» із трьома сухопарниками — компактне та ефективне обладнання для домашнього виготовлення чистого й ароматного самогону. Герметичний куб із нержавіючої сталі, проста збірка, повна комплектація та можливість ароматизації напоїв роблять цей апарат ідеальним вибором для домашнього винокуріння.",
    "shop/02405-700x700.jpg",
  ),
  alternates: {
    canonical: 'https://smakota.club/shop/smakuy-baby-bum',
  },
};